app/controllers/posts_controller.rb

INSERT INTO "posts" ("body", "title") VALUES (?, ?)  [["body", "TextAboutThis"], ["title", "ThisHeader"]]
---
	def create
		puts params
		Post.create(post_params)